<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Pandas Data Munging Full Overview

_Authors: Joseph Nelson (DC)_

---

### Lesson Guide
- [Basics of pandas dataframes](#basics)
    - [Loading data](#loading)
    - [Basic examination of data](#examination)
    - [Selecting columns](#selecting)
    - [Describing the data](#describing)
- [Exercise 1](#exercise-1)
- [Sorting and filtering dataframes](#sorting-filtering)
    - [Filtering](#filtering)
    - [Sorting](#sorting)
- [Exercise 2](#exercise-2)
- [Renaming, adding, and removing columns](#columns)
    - [Renaming columns](#renaming-columns)
    - [Adding columns](#adding-columns)
    - [Removing columns](#removing-columns)
- [Handling missing values](#missing)
    - [Find missing values](#find-missing)
    - [Drop missing values](#drop-missing)
    - [Fill in missing values](#fill-missing)
- [Exercise 3](#exercise-3)
- [Split-apply-combine](#split-apply-combine)
    - [Groupby](#groupby)
    - [Apply and combine](#apply-combine)
- [Exercise 4](#exercise-4)
- [Indexing](#indexing)
    - [Location indexing with .loc](#loc)
    - [Position indexing with .iloc](#iloc)
- [Other frequently used features](#frequent)
    - [Use map functions with replacement dictionaries](#map-dict)
    - [Encode strings as integers with .factorize](#factorize)
    - [Determine unique values](#unique)
    - [Replace values with .replace](#replace)
    - [Series string methods with .str](#series-str)
    - [Datetime conversion and arithmetic](#datetime)
    - [Setting and resetting the index](#set-reset-index)
    - [Sort by index](#sort-by-index)
    - [Change data type of a column](#change-dtype)
    - [Create dummy-coded columns](#dummy)
    - [Concatenate dataframes](#concatenate)
    - [Detect and drop duplicate rows](#duplicate-rows)
    - [Write a dataframe to a csv](#write-csv)
    - [Pickle a dataframe](#pickle)
    - [Randomly sample a dataframe](#sample)
- [Infrequently used features](#infrequent)
    - [Creating dataframes from dictionaries and lists of lists](#toy-dataframes)
    - [Doing cross-tabulations](#crosstab)
    - [Query filtering syntax](#query)
    - [Calculate memory usage](#memory-usage)
    - [Converting column to category type](#category-type)
    - [Creating columns with the assign function](#assign)
    - [Limit number of rows to load on file read](#limit-rows-read)
    - [Manually set number of rows and columns to print](#manual-print)

<a id='basics'></a>

## Reading Files, Selecting Columns, and Summarizing

---

In [2]:
import pandas as pd

<a id='loading'></a>
### Loading data

**Q.1** You can read a file from your local computer or directly from a URL.

In [3]:
# Local:
# pd.read_table('u.user')

# Remote:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')
users.head(2)

  user_id|age|gender|occupation|zip_code
0                1|24|M|technician|85711
1                     2|53|F|other|94043

**Q.2** Use kwargs to set appropriate data-reading parameters.

In [5]:
# A:

users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|', index_col='user_id')
users.head(2)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043

<a id='examine'></a>
### Basic examination of dataframes

**Q.1** Print the type of `users`.

In [6]:
# A:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Q.2** Print the first 5 rows, first 10 rows, and last 2 rows of `users`.

In [7]:
# A:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [8]:
# A:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [16]:
# A:
users.tail(2)

         age gender occupation zip_code
user_id
942       48      F  librarian    78209
943       22      M    student    77841

**Q.3** Print the index and columns.

In [19]:
# A:
print users.index
print users.columns

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name=u'user_id', length=943)
Index([u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

**Q.4** Find the dtypes of the columns.

In [21]:
# A:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Q.5** Find the dimensions of the dataframe.

In [22]:
# A:
users.shape

(943, 4)

**Q.6** Extract the underlying numpy array as a new variable.

In [10]:
x=users.values
print type(x),x.shape

<type 'numpy.ndarray'> (943, 4)

<a id='selecting'></a>
### Selecting columns

**Q.1** Assign the `gender` column to a variable.

In [12]:
# A:
gender=users['gender']

**Q.2** What is the type of `gender`?

In [13]:
# A:
type(gender)

pandas.core.series.Series

**Q.3** Select `gender` and `occupation` as a new dataframe.

In [15]:
# A:
df= users[['gender','occupation']]

<a id='describing'></a>
### Describing the data

**Q.1** Calculate the descriptive statistics for the numeric columns in the dataframe.

In [16]:
# A:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

**Q.2** Describe the "object" (string) columns.

In [18]:
# A:
users.describe(include=['object'])

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

**Q.3** Describe all the columns regardless of type.

In [20]:
# A:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

**Q.4** Describe the `gender` Series from the `users` dataframe.

In [21]:
# A:
users.gender.describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

**Q.5** Calculate the mean of the `age` column.

In [23]:
# A:
import numpy as np
np.mean(users['age'])

34.05196182396607

**Q.6** Calculate the counts of distinct values in the gender and age column.

In [26]:
# A:
print "count of distncit values in the gender :" ,users.gender.value_counts()
print "count of distncit values in age :" ,users.age.value_counts()

count of distncit values in the gender : M    670
F    273
Name: gender, dtype: int64
count of distncit values in age : 30    39
25    38
22    37
28    36
27    35
26    34
24    33
29    32
20    32
32    28
23    28
35    27
21    27
33    26
31    25
19    23
44    23
39    22
40    21
36    21
42    21
51    20
50    20
48    20
49    19
37    19
18    18
34    17
38    17
45    15
      ..
47    14
43    13
46    12
53    12
55    11
41    10
57     9
60     9
52     6
56     6
15     6
13     5
16     5
54     4
63     3
14     3
65     3
70     3
61     3
59     3
58     3
64     2
68     2
69     2
62     2
11     1
10     1
73     1
66     1
7      1
Name: age, dtype: int64

<a id='exercise=1'></a>
## Exercise 1

---

Load the `drinks.csv` data provided in the url below.

**Perform the following:**
1. Print the head and tail.
- Look at the index, columns, dtypes and shape.
- Assign the `beer_servings` column/Series to a variable.
- Calculate summary statistics for `beer_servings`.
- Calculate the median of `beer_servings`.
- Count the values of unique categories in `continent`.
- Print the dimensions of the drinks dataframe.
- Find the first 3 items of the value counts of the `occupation` column.

**BONUS:**
- Create the 'users' DataFrame from the `user_file` provided (which lacks a header row).
- Supply a header: `['user_id', 'age', 'gender', 'occupation', 'zip_code']`

In [27]:
drinks_csv = 'https://raw.githubusercontent.com/josephnelson93/GA-DSI/master/example-lessons/plotting-with-pandas/drinks.csv'
user_file = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user_original'

In [30]:
# A:
import pandas as pd
drinks=pd.read_table(drinks_csv)
drinks.head(5)

  country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0                           Afghanistan,0,0,0,0.0,AS
1                           Albania,89,132,54,4.9,EU
2                             Algeria,25,0,14,0.7,AF
3                        Andorra,245,138,312,12.4,EU
4                            Angola,217,57,45,5.9,AF

In [34]:
drinks=pd.read_csv(drinks_csv, sep='|')
drinks.head(5)

  country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0                           Afghanistan,0,0,0,0.0,AS
1                           Albania,89,132,54,4.9,EU
2                             Algeria,25,0,14,0.7,AF
3                        Andorra,245,138,312,12.4,EU
4                            Angola,217,57,45,5.9,AF

<a id='filtering-sorting'></a>

## Filtering and sorting dataframes and series

---

<a id='filtering'></a>
### Boolean filtering

**Q.1** Show users with age < 20 using a boolean mask.

In [36]:
# A:
[users['age']<200]

[user_id
 1      True
 2      True
 3      True
 4      True
 5      True
 6      True
 7      True
 8      True
 9      True
 10     True
 11     True
 12     True
 13     True
 14     True
 15     True
 16     True
 17     True
 18     True
 19     True
 20     True
 21     True
 22     True
 23     True
 24     True
 25     True
 26     True
 27     True
 28     True
 29     True
 30     True
        ...
 914    True
 915    True
 916    True
 917    True
 918    True
 919    True
 920    True
 921    True
 922    True
 923    True
 924    True
 925    True
 926    True
 927    True
 928    True
 929    True
 930    True
 931    True
 932    True
 933    True
 934    True
 935    True
 936    True
 937    True
 938    True
 939    True
 940    True
 941    True
 942    True
 943    True
 Name: age, dtype: bool]

**Q.2** Calculate value counts of occupation for users age < 20.

In [41]:
# A:

users[users.age < 20].occupation.value_counts()

student          64
other             4
none              3
writer            2
entertainment     2
salesman          1
artist            1
Name: occupation, dtype: int64

**Q.3** Print the male users age < 20.

In [47]:
# A:
users[(users.age>20) & (users.gender == 'M')]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
3         23      M         writer    32067
4         24      M     technician    43537
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
13        47      M       educator    29206
14        45      M      scientist    55106
16        21      M  entertainment    10309
17        30      M     programmer    06355
19        40      M      librarian    02138
21        26      M         writer    30068
22        25      M         writer    40206
25        39      M       engineer    55107
26        49      M       engineer    21044
28        32      M         writer    55369
29        41      M     programmer    94043
31        24      M         artist    10003
33        23      M        student    27510
37        23      M        student    55105
39        41      M  entertainment    01040
40        38      M      scientist    27514
41        33      M       engineer    80525
42        30      M  administrator    17870
44        26      M     technician    46260
45        29      M     programmer    50233
47        53      M      marketing    07102
48        45      M  administrator    12550
...      ...    ...            ...      ...
897       30      M          other    33484
898       23      M      homemaker    61755
899       32      M          other    55116
900       60      M        retired    18505
901       38      M      executive    L1V3W
903       28      M       educator    20850
905       27      M          other    30350
906       45      M      librarian    70124
910       28      M     healthcare    29301
912       51      M          other    06512
913       27      M        student    76201
915       50      M  entertainment    60614
916       27      M       engineer    N2L5N
918       40      M      scientist    70116
919       25      M          other    14216
923       21      M        student    E2E3R
924       29      M          other    11753
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
940       32      M  administrator    02215
943       22      M        student    77841

[603 rows x 4 columns]

**Q.4** Print the users age < 10 or age > 70.

In [48]:
# A:
users[(users.age<10) | (users.age>70)]

         age gender occupation zip_code
user_id
30         7      M    student    55436
481       73      M    retired    37771

<a id='sorting'></a>
### Sorting

**Q.1** Return the age column sorted (ascending order)

In [52]:
# A:
users.age.order()

/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

user_id
30      7
471    10
289    11
880    13
609    13
142    13
674    13
628    13
813    14
206    14
887    14
849    15
281    15
461    15
618    15
179    15
101    15
57     16
580    16
550    16
451    16
434    16
621    17
619    17
761    17
375    17
904    17
646    17
582    17
257    17
       ..
90     60
308    60
931    60
752    60
469    60
464    60
234    60
694    60
934    61
351    61
106    61
520    62
266    62
858    63
777    63
364    63
845    64
423    64
318    65
651    65
564    65
211    66
349    68
573    68
559    69
585    69
767    70
803    70
860    70
481    73
Name: age, dtype: int64

**Q.2** Sort the users dataframe by the age column (ascending).

In [53]:
# A:
users.sort('age',ascending=False)

/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  from ipykernel import kernelapp as app

         age gender     occupation zip_code
user_id
481       73      M        retired    37771
803       70      M  administrator    78212
767       70      M       engineer    00000
860       70      F        retired    48322
585       69      M      librarian    98501
559       69      M      executive    10022
349       68      M        retired    61455
573       68      M        retired    48911
211       66      M       salesman    32605
651       65      M        retired    02903
564       65      M        retired    94591
318       65      M        retired    06518
845       64      M         doctor    97405
423       64      M          other    91606
858       63      M       educator    09645
364       63      M       engineer    01810
777       63      M     programmer    01810
266       62      F  administrator    78756
520       62      M     healthcare    12603
934       61      M       engineer    22902
351       61      M       educator    49938
106       61      M        retired    55125
464       60      M         writer    94583
469       60      M       educator    78628
234       60      M        retired    94702
900       60      M        retired    18505
308       60      M        retired    95076
931       60      M       educator    33556
694       60      M     programmer    06365
752       60      M        retired    21201
...      ...    ...            ...      ...
700       17      M        student    76309
646       17      F        student    51250
863       17      M        student    60089
375       17      M  entertainment    37777
761       17      M        student    97302
621       17      M        student    60402
257       17      M        student    77005
904       17      F        student    61073
434       16      F        student    49705
451       16      M        student    48446
550       16      F        student    95453
57        16      M           none    84010
580       16      M        student    17961
179       15      M  entertainment    20755
461       15      M        student    98102
618       15      F        student    44212
849       15      F        student    25652
281       15      F        student    06059
101       15      M        student    05146
813       14      F        student    02136
887       14      F        student    27249
206       14      F        student    53115
628       13      M           none    94306
674       13      F        student    55337
142       13      M          other    48118
880       13      M        student    83702
609       13      F        student    55106
289       11      M           none    94619
471       10      M        student    77459
30         7      M        student    55436

[943 rows x 4 columns]

**Q.3** Sort the users dataframe by the age column *descending*.

In [54]:
# A:
users.sort('age',ascending=True)

/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  from ipykernel import kernelapp as app

         age gender     occupation zip_code
user_id
30         7      M        student    55436
471       10      M        student    77459
289       11      M           none    94619
880       13      M        student    83702
609       13      F        student    55106
142       13      M          other    48118
674       13      F        student    55337
628       13      M           none    94306
813       14      F        student    02136
206       14      F        student    53115
887       14      F        student    27249
849       15      F        student    25652
281       15      F        student    06059
461       15      M        student    98102
618       15      F        student    44212
179       15      M  entertainment    20755
101       15      M        student    05146
57        16      M           none    84010
580       16      M        student    17961
550       16      F        student    95453
451       16      M        student    48446
434       16      F        student    49705
621       17      M        student    60402
619       17      M        student    44134
761       17      M        student    97302
375       17      M  entertainment    37777
904       17      F        student    61073
646       17      F        student    51250
582       17      M        student    93003
257       17      M        student    77005
...      ...    ...            ...      ...
90        60      M       educator    78155
308       60      M        retired    95076
931       60      M       educator    33556
752       60      M        retired    21201
469       60      M       educator    78628
464       60      M         writer    94583
234       60      M        retired    94702
694       60      M     programmer    06365
934       61      M       engineer    22902
351       61      M       educator    49938
106       61      M        retired    55125
520       62      M     healthcare    12603
266       62      F  administrator    78756
858       63      M       educator    09645
777       63      M     programmer    01810
364       63      M       engineer    01810
845       64      M         doctor    97405
423       64      M          other    91606
318       65      M        retired    06518
651       65      M        retired    02903
564       65      M        retired    94591
211       66      M       salesman    32605
349       68      M        retired    61455
573       68      M        retired    48911
559       69      M      executive    10022
585       69      M      librarian    98501
767       70      M       engineer    00000
803       70      M  administrator    78212
860       70      F        retired    48322
481       73      M        retired    37771

[943 rows x 4 columns]

<a id='exercise-2'></a>

## Exercise 2

---

**Using the drinks dataframe from the previous exercise:**
1. Filter drinks to include only European countries.
- Filter drinks to include only European countries with `wine_servings` > 300.
- Calculate the mean `beer_servings` for all of Europe.
- Which 10 countries have the highest `total_litres_of_pure_alcohol`?

**Using the users dataframe:**
1. Sort users by occupation and then by age in a single command.
- Filter users to only include doctors and lawyers without using a `|`

> *Hint:* look up `pandas.Series.isin`

In [55]:
# A:
drinks.head(1)

  country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0                           Afghanistan,0,0,0,0.0,AS

In [59]:
drinks['continent']

KeyError: 'continent'

<a id='columns'></a>

## Renaming, adding, and removing columns

---

<a id='renaming-columns'></a>
### Renaming columns

**Q.1** Rename "beer_servings" to "beer" and "wine_servings" to wine in the drinks dataframe, returning a *new* dataframe.

In [31]:
# A:

**Q.2** Do the same renaming for drinks, but inplace.

In [32]:
# A:

**Q.3** Replace the column names of drinks with `['country', 'beer', 'spirit', 'wine', 'liters', 'continent']`

In [33]:
# A:

<a id='adding-columns'></a>
### Adding columns

**Q.1** Make a "servings" column that is beer + spirit + wine

In [34]:
# A:

**Q.2** Make a "mL" column that is the liters column times 1000.

In [35]:
# A:

<a id='removing-columns'></a>
### Removing columns

**Q.1** Remove the "mL" column returning a new dataframe.

In [36]:
# A:

**Q.2** Remove the "mL" and "servings" columns from drinks inplace.

In [37]:
# A:

<a id='missing'></a>
## Handling missing values

---

<a id='find-missing'></a>
### Finding missing values

**Q.1** Include missing values of the continent variable in the drinks dataframe when counting unique values.

In [38]:
# A:

**Q.2** Create a boolean Series representing which values are missing and not missing in continents.

In [39]:
# A:

**Q.3** Subset to rows in drinks where continent is missing and where continent is not missing.

In [40]:
# A:

**Q.4** [Side note] Calculate the sum of drink *columns* and the sum of *rows*.

In [41]:
# A:

In [42]:
# A:

**Q.5** FInd the number of missing values by column in drinks.

In [43]:
# A:

<a id='drop-missing'></a>
### Dropping missing values

**Q.1** Drop rows where *ANY* values are missing in drinks (return new dataframe)

In [44]:
# A:

**Q.2** Drop rows only where *ALL* values are missing in drinks.

In [45]:
# A:

<a id='fill-missing'></a>
### Fill in missing values

**Q.1** Fill in the missing values of the continent column with string "NA"

In [46]:
# A:

**Q.2** Turn off the missing value filter when loading the drinks csv.

In [47]:
# A:

<a id='exercise-3'></a>
## Exercise 3

---

**Using the ufo data provided below:**
1. Read in the data.
- Check the shape and describe the columns.
- Find the four most reported colors.
- Find the most frequent city for reports in state VA.
- Find only UFO reports from Arlington, VA
- Find the number of missing values in each column.
- Show only UFO reporst where city is missing
- Count the number of rows with no null values.
- Replace column names with spaces to have underscores.
- Make a new column that is a combination of city and state.

In [48]:
ufo_csv = 'https://raw.githubusercontent.com/josephofiowa/DAT8/master/data/ufo.csv'

In [49]:
# A:

<a id='split-apply-combine'></a>
## Split-apply-combine

---

![](http://i.imgur.com/yjNkiwL.png)

<a id='groupby'></a>
### Grouping

**Q.1** With the drinks dataframe, calculate the mean bear servings by continent.

In [50]:
# A:

**Q.2** Describe the beer column by continent.

In [51]:
# A:

<a id='apply-combine'></a>
### Apply functions to groups and combine

**Q.1** Find the count, mean, minimum, and maximum of the beer column by continent.

In [52]:
# A:

**Q.2** Do the same as in Q.1, but sort the output by the mean column.

In [53]:
# A:

**Q.3** Apply a custom function to all the columns of the drinks dataframe, grouped by continent.

In [54]:
# A:

**Q.4** [Note] If you don't specify a column for the aggregation function, it will be applied to all numeric columns.

In [55]:
# A:

<a id='exercise-4'></a>

## Exercise 4

---

**Using the users dataframe**:
1. Count the number of distinct occupations in users.
- Calculate the mean age by occupation.
- Calculate the minimum and maximum age by occupation.
- Calculate the mean age by cross-sections of occupation and gender.

> *Tip: multiple columns can be passed to the groupby function for granular cross-sections.*

In [56]:
# A:

<a id='indexing'></a>
## Indexing

---

<a id='loc'></a>
### Label indexing with `.loc`

**Q.1** Select all rows and the "City" column from the ufo dataset with `.loc`.

In [57]:
# A:

**Q.2** Select all rows and columns "City" and "State"

In [58]:
# A:

**Q.3** Select all rows and columns from "City" *through* "State"

In [59]:
# A:

**Q.4** Select:
- all columns at row 0
- all columns at rows 0:2
- columns "City" through "State" at rows 0:2

In [60]:
# A:

<a id='iloc'></a>
### Position indexing with `.iloc`

**Q.1** Select all rows and columns in position 0 and 3.

In [61]:
# A:

**Q.2** Select all rows and columns 0 through 4.

In [62]:
# A:

**Q.3** Select rows in position 0:3 and all columns.

In [63]:
# A:

<a id='frequent'></a>
## Frequently used features

---

<a id='map-dict'></a>
### The `.map` function with replacement dictionaries

In [64]:
# A:

<a id='factorize'></a>
### Encode strings as integers with `.factorize`

In [65]:
# A:

<a id='unique'></a>
### Determine unique values

In [66]:
# A:

<a id='replace'></a>
### Replace values with `.replace`

In [67]:
# A:

<a id='series-str'></a>
### Series string methods with `.str`

In [68]:
# A:

<a id='datetime'></a>
### `datetime` conversion and arithmetic

In [69]:
# A:

<a id='set-reset-index'></a>
### Setting and resetting the index

In [70]:
# A:

<a id='sort-by-index'></a>
### Sorting by the index

In [71]:
# A:

<a id='change-dtype'></a>
### Changing the data type of a column

In [72]:
# A:

<a id='dummy'></a>
### Create dummy-coded columns from a categorical column

In [73]:
# A:

<a id='concatenate'></a>
### Concatenate dataframes together

In [74]:
# A:

<a id='duplicate-rows'></a>
### Detect and drop duplicate rows

In [75]:
# A:

<a id='write-csv'></a>
### Write a dataframe to a csv

In [76]:
# A:

<a id='pickle'></a>
### Write a dataframe to a pickle object

In [77]:
# A:

<a id='sample'></a>
### Randomly sample a dataframe

In [78]:
# A:

<a id='infrequent'></a>
## Infrequently used features

---

<a id='toy-dataframes'></a>
### Create dataframes from dictionaries and lists of lists

In [79]:
# A:

<a id='crosstab'></a>
### Do a cross-tabulation between Series

In [80]:
# A:

<a id='query'></a>
### Query syntax for filtering

In [81]:
# A:

<a id='memory-usage'></a>
### Calculate memory usage

In [82]:
# A:

<a id='category-type'></a>
### Convert a column to type 'category'

In [83]:
# A:

<a id='assign'></a>
### Define column with `.assign`

In [84]:
# A:

<a id='limit-rows-read'></a>
### Limit rows when reading a file

In [85]:
# A:

<a id='manual-print'></a>
### Manually set maximum rows and columns to print

In [86]:
# A: